**Basic Data Frames Operations**

In [1]:
================== Data Analysis ====================
1.   Pandas              : Data frame analysis
2.   Numpy               : Numerical analysis
3.   Matplotlib          : Graphs and plots
4.   Seaborn             : Plots
5.   Bokeh               : Plots
6.   Plotly              : Plots

================== Machine Learning =================
7.   Stats               : Statistical models
8.   Scikit-learn        : ML models

================== Deep Learning ====================
9.   OpenCV              : Computer vision
10.  Pillow              : Image operations
11.  TensorFlow          : Neural network creation (Google)
12.  Keras               : Neural networks
13.  PyTorch             : Alternative to TensorFlow (Meta/Facebook)

====================== NLP ==========================
14.  NLTK                : Natural language toolkit
15.  SpaCy               : Alternative to NLTK
16.  WordCloud           : Most frequent words

==================== Scraping =======================
17.  SQLite              : Database creation
18.  Beautiful Soup      : Web scraping
19.  Selenium            : Web automation

================== API Creation =====================
20.  Flask               : Web framework
21.  FastAPI             : Web framework
22.  Gradio              : API/UI creation
23.  Django              : Web framework

================== UI App Creation ==================
24.  Streamlit           : UI/Apps for ML/DL

========== Transfer Learning Models (DL) ============
25.  MobileNet           : CNN model
26.  ResNet              : CNN model
27.  VGGNet              : CNN model
28.  Inception           : CNN model
29.  YOLO                : Object detection (Ultralytics)

========== Transfer Learning Models (NLP) ===========
30.  Word2Vec            : Word embeddings
31.  GloVe               : Word embeddings

=============== Hugging Face Transformers ===========
32.  BERT                : Bi-directional Encoder Representations

==================== Allen NLP ======================
33.  AllenNLP            : NLP research library

====================== GenAI =========================
34.  LangChain           : LLM orchestration
35.  Google Gemini       : Google’s GenAI models
36.  OpenAI GPT          : OpenAI’s LLMs
37.  Amazon Bedrock      : AWS GenAI platform
38.  Meta LLaMA          : Meta’s LLM family

================ Image and Video Generation ==========
39.  GAN models          : Image/Video generation packages
40.  SORA                : Video generation (OpenAI)

================ Model Deployment (MLOps) ============
41.  MLflow              : Using Databricks
42.  Kubeflow            : GCP MLOps platform

================== Cloud Applications ================
43.  Azure ML            : Microsoft cloud ML platform
44.  GCP Vertex AI       : Google cloud ML platform
45.  AWS SageMaker       : AWS cloud ML platform

======================= Small ========================
46.  Time                : Time operations
47.  Logging             : Logging utilities
48.  Math                : Mathematical operations
49.  Random              : Random number generation
50.  Env                 : Environment variables
51.  OS                  : Operating system utilities

SyntaxError: invalid character '’' (U+2019) (1281075334.py, line 58)

**Step-1: Import Packages**

In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a DataFrame using List**

- data : data is either list or dictionary format

- index : we need to provide a list

- columns : we need to provide a list

In [4]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,columns=['Names'])
#pd.DataFrame(data,index,columns)

    Names
0  Ramesh
1  Suresh
2  Satish

**Step-3: Change the Index**

In [5]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names']
pd.DataFrame(names,index=idx,columns=cols)

    Names
A  Ramesh
B  Suresh
C  Satish

**Step-4: Add Multiple Columns**

In [6]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
pd.DataFrame(zip(names,age),index=idx,columns=cols)

    Names  Age
A  Ramesh   20
B  Suresh   22
C  Satish   24

**Step-5: Create empty DataFrame and update the columns**

In [7]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,24]
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

**Step-6: Add a new column with existing DataFrame**

In [ ]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['City']=['Pune','Hyderabad','Bangalore']
df

**Step-7: Override the column values**
- I want to overrite my age values
- Origionally age was=[20,22,24]
- I want to update the age=[30,32,34]

In [ ]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['Age']=[30,32,34]
df

In [ ]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['Age']=[30,32,34]
df['age']=[30,32,34]
df

**Step-8: Drop The Column**

- lables
  
- axis
  
- index
  
- columns
  
- inplace

In [ ]:
df

In [ ]:
df.drop('age') #error
#here python will assume age is a label
#python ask question :is it index label or column label
#axis=1 means for columns
#axis=0 means for rows
#by default axis=0

In [ ]:
df.drop('age',axis=0)

In [ ]:
df.drop('age',axis=1)
df

In [ ]:
df.drop('age',axis=1,inplace=True)
df

In [ ]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['Age']=[30,32,34]
df['age']=[11,12,13]
df

In [ ]:
df.drop(columns=['age'],inplace=True)
#no need of axis
df

In [ ]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['Age']=[30,32,34]
df['age']=[11,12,13]
df

In [ ]:
df.drop('C',axis=0)

**Step-9: Rename The Columns**
- mapper: dictionary {'City':'Cities'}
- index:
- columns: 
- axis:
- copy:
- inplace:

In [ ]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['City']=['Pune','Hyderabad','Bangalore']
df

In [ ]:
dict={'City':'Cities'}
df.rename(dic)
df

In [ ]:
df.rename(columns=dict)
df

In [ ]:
df.rename(columns=dict,inplace=True)
df

In [ ]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names','Age']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),index=idx,columns=cols)
df['City']=['Pune','Hyderabad','Bangalore']
df.rename(dict,axis=1)
df

In [ ]:
df.rename(dict,axis=1,inplace=True)
df

In [ ]:
dict={'B':2}
df.rename(dict)
df

In [ ]:
dict={'A':1,'B':2,'C':3}
df.rename(dict,inplace=True)
df

In [9]:
df1=pd.DataFrame()
df1['Value']=[i for i in range(1,11)]
df1['Square_Value']=[i**2 for i in range(1,11)]
df1['Cube_Value']=[i**3 for i in range(1,11)]
df1

   Value  Square_Value  Cube_Value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

- len

- columns

- shape

- dtypes

- head

- tail

In [10]:
len(df1)

10

In [ ]:
df1.columns

In [11]:
df1.columns.to_list()

['Value', 'Square_Value', 'Cube_Value']

In [ ]:
df1.shape

In [ ]:
df1.dtypes
#integer we will get integer
#float we will get float
#string we will get object

In [12]:
df1.head()

   Value  Square_Value  Cube_Value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125

In [ ]:
df1.tail()

In [ ]:
df1.isnull()
#we are asking a question
#a null value available or not
#True or False
#True means yes NULL available
#False means no NULL value available

In [13]:
df1.isnull().sum()
#column wise null value count will be displayed

Value           0
Square_Value    0
Cube_Value      0
dtype: int64

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Value         10 non-null     int64
 1   Square_Value  10 non-null     int64
 2   Cube_Value    10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [ ]:
**Step-10: Change a Specific Value of a column**

-df1.drop
    
    -either it will drop column or index
    
-df1.rename
    
    -either it will rename column or index

-df1.replace

    -replece previous value to new value

In [15]:
dict2={64:464,1:111} #all data will replace
df1.replace(dict2)

   Value  Square_Value  Cube_Value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729
9     10           100        1000

**Step-11: Selection Of A Column**

In [ ]:
df1['Cube_Value']
#series
#series looks like data frame
#rows and columns

In [ ]:
type(df1)

In [16]:
type(df1['Cube_Value'])

pandas.core.series.Series

In [ ]:
df1.shape
# 2D datta

In [ ]:
df1['Cube_Value'].shape
#1D Data

In [ ]:
df1[['Cube_Value']]

In [ ]:
type(df1[['Cube_Value']])

In [ ]:
df1[['Cube_Value']].shape

In [ ]:
#square value
#cube value
#multiple always keep in list
df1['Cube_Value','Square_Value']

In [17]:
df1[['Cube_Value','Square_Value']]

   Cube_Value  Square_Value
0           1             1
1           8             4
2          27             9
3          64            16
4         125            25
5         216            36
6         343            49
7         512            64
8         729            81
9        1000           100

In [21]:
df1=pd.DataFrame()
df1['Value']=[i for i in range(1,11)]
df1['Square_Value']=[i**2 for i in range(1,11)]
df1['Cube_Value']=[i**3 for i in range(1,11)]
df1

   Value  Square_Value  Cube_Value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

In [25]:
df1['Cube_Value'].replace(64,464,inplace=True)
df1

C:\Users\Shubh\AppData\Local\Temp\ipykernel_12224\1522392975.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['Cube_Value'].replace(64,464,inplace=True)

   Value  Square_Value  Cube_Value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

**Step-12: How to append a Row**
- loc

- iloc

In [27]:
# df1.loc[rows,columns]
# df1.iloc[rows,columns]

#we can select particular rows and columns in using a list: [start:stop:step]

df1.iloc[3:7,1:3]

   Square_Value  Cube_Value
3            16         464
4            25         125
5            36         216
6            49         343

In [28]:
df1.loc[3:7,1:3]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [30]:
cols=['Square_Value','Cube_Value']
df1.loc[3:7,cols]

   Square_Value  Cube_Value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [31]:
df1.iloc[[2,3,4]]
#selecting 3 rows all columns

   Value  Square_Value  Cube_Value
2      3             9          27
3      4            16         464
4      5            25         125

In [32]:
df1.iloc[[2]]
#selecting 1 rows all columns
#2d DataFrame

   Value  Square_Value  Cube_Value
2      3             9          27

In [42]:
df1.iloc[2]
#1d series

Value            3
Square_Value     9
Cube_Value      27
Name: 2, dtype: int64

In [34]:
df1.iloc[[2,3,4],[0,2]]
#selectiing 3 rows and first and third columns

   Value  Cube_Value
2      3          27
3      4         464
4      5         125

In [45]:
df1.iloc[2,0]
#selecting 3rd row and first column
#series 1D

np.int64(3)

In [36]:
df1.iloc[:,0]
#all rows first column ---Series 1D

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Value, dtype: int64

In [37]:
df1.iloc[2,:]
#2nd row all columns Series 1D

Value            3
Square_Value     9
Cube_Value      27
Name: 2, dtype: int64

In [38]:
df1.iloc[[2],:]

   Value  Square_Value  Cube_Value
2      3             9          27

In [39]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: Value, dtype: int64

In [40]:
df1.iloc[2:6,[0]]

   Value
2      3
3      4
4      5
5      6

**Step-13: How to append a Row**

In [47]:
df1.loc[10]=[11,121,1000]
df1

    Value  Square_Value  Cube_Value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121        1000

In [48]:
ID=len(df1)
df1.loc[ID]=[12,144,1728]
df1

    Value  Square_Value  Cube_Value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121        1000
11     12           144        1728

**Step-13: Save the DataFrame**

- We can save the data in 2 ways

   - .csv

   - .xlsx
 
- Where i want to save : File Directory

- What the filename to Save : file name

- What is the type of a file : extension

- Different Folder : r"C:\Users\Shubh\Desktop\Full Stack Data Science\data1.csv"

- Different Folder : r"C:\Users\Shubh\Desktop\Full Stack Data Science\data1.xlsx"

- Same Folder : r"data1.csv" or r"data1.xlsx"

In [51]:
csv_path=r"C:\Users\Shubh\Desktop\Full Stack Data Science\data1.csv"
excel_path=r"C:\Users\Shubh\Desktop\Full Stack Data Science\data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

In [56]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path,index=False) #index column added extra
df1.to_excel(excel_path,index=False) #index column added extra

**Step-14: Read The Data**

In [57]:
pd.read_csv(csv_path)

    Value  Square_Value  Cube_Value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121        1000
11     12           144        1728

In [58]:
pd.read_excel(excel_path)

    Value  Square_Value  Cube_Value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121        1000
11     12           144        1728